Masmiseim36/iMXRT/targets/iMXRText/Loader2/drivers/fsl_lpuart.c
    const uint8_t *dataAddress = data;
    size_t transferSize        = length;

#if UART_RETRY_TIMES
    uint32_t waitTimes;
#endif

    while (0U != transferSize)
    {
#if UART_RETRY_TIMES
        waitTimes = UART_RETRY_TIMES;
        while ((0U == (base->STAT & LPUART_STAT_TDRE_MASK)) && (0U != --waitTimes))
#else
        while (0U == (base->STAT & LPUART_STAT_TDRE_MASK))
#endif
        {
        }
#if UART_RETRY_TIMES
        if (0U == waitTimes)
        {
            return kStatus_LPUART_Timeout;
        }
#endif
        base->DATA = *(dataAddress);
        dataAddress++;
        transferSize--;
    }
    /* Ensure all the data in the transmit buffer are sent out to bus. */
#if UART_RETRY_TIMES
    waitTimes = UART_RETRY_TIMES;
    while ((0U == (base->STAT & LPUART_STAT_TC_MASK)) && (0U != --waitTimes))
#else
    while (0U == (base->STAT & LPUART_STAT_TC_MASK))
#endif
    {
    }
#if UART_RETRY_TIMES
    if (0U == waitTimes)
    {
        return kStatus_LPUART_Timeout;
    }
#endif
    return kStatus_Success;
}

/*!
 * brief Writes to the transmitter register using a blocking method in 9bit or 10bit mode.
 *
 * note This function only support 9bit or 10bit transfer.
 *       Please make sure only 10bit of data is valid and other bits are 0.
 *
 * param base LPUART peripheral base address.
 * param data Start address of the data to write.
 * param length Size of the data to write.
 * retval kStatus_LPUART_Timeout Transmission timed out and was aborted.
 * retval kStatus_Success Successfully wrote all data.
 */
status_t LPUART_WriteBlocking16bit(LPUART_Type *base, const uint16_t *data, size_t length)
{
    assert(NULL != data);

    const uint16_t *dataAddress = data;
    size_t transferSize         = length;

#if UART_RETRY_TIMES
    uint32_t waitTimes;
#endif

    while (0U != transferSize)
    {
#if UART_RETRY_TIMES
        waitTimes = UART_RETRY_TIMES;
        while ((0U == (base->STAT & LPUART_STAT_TDRE_MASK)) && (0U != --waitTimes))
#else
        while (0U == (base->STAT & LPUART_STAT_TDRE_MASK))
#endif
        {
        }
#if UART_RETRY_TIMES
        if (0U == waitTimes)
        {
            return kStatus_LPUART_Timeout;
        }
#endif
        base->DATA = *(dataAddress);
        dataAddress++;
        transferSize--;
    }
    /* Ensure all the data in the transmit buffer are sent out to bus. */
#if UART_RETRY_TIMES
    waitTimes = UART_RETRY_TIMES;
    while ((0U == (base->STAT & LPUART_STAT_TC_MASK)) && (0U != --waitTimes))
#else
    while (0U == (base->STAT & LPUART_STAT_TC_MASK))
#endif
    {
    }
#if UART_RETRY_TIMES
    if (0U == waitTimes)
    {
        return kStatus_LPUART_Timeout;
    }
#endif
    return kStatus_Success;
}

static status_t LPUART_WaitForReadData(LPUART_Type *base)
{
    status_t status = kStatus_Success;
    uint32_t statusFlag;

#if UART_RETRY_TIMES
    uint32_t waitTimes = UART_RETRY_TIMES;
#endif

#if defined(FSL_FEATURE_LPUART_HAS_FIFO) && FSL_FEATURE_LPUART_HAS_FIFO
    while (0U == ((base->WATER & LPUART_WATER_RXCOUNT_MASK) >> LPUART_WATER_RXCOUNT_SHIFT))
#else
    while (0U == (base->STAT & LPUART_STAT_RDRF_MASK))
#endif
    {

#if UART_RETRY_TIMES
        if (0U == --waitTimes)
        {
            status = kStatus_LPUART_Timeout;
            break;
        }
#endif
        statusFlag = LPUART_GetStatusFlags(base);

        if (0U != (statusFlag & (uint32_t)kLPUART_RxOverrunFlag))
        {
            /*
             * $Branch Coverage Justification$
             * $ref fsl_lpuart_c_ref_2$.
             */
            status = ((kStatus_Success == LPUART_ClearStatusFlags(base, (uint32_t)kLPUART_RxOverrunFlag)) ?
                          (kStatus_LPUART_RxHardwareOverrun) : /* GCOVR_EXCL_BR_LINE */
                          (kStatus_LPUART_FlagCannotClearManually));
            /* Other error flags(FE, NF, and PF) are prevented from setting once OR is set, no need to check other
             * error flags*/
            break;
        }

        if (0U != (statusFlag & (uint32_t)kLPUART_ParityErrorFlag))
        {
            /*
             * $Branch Coverage Justification$
             * $ref fsl_lpuart_c_ref_2$.
             */
            status = ((kStatus_Success == LPUART_ClearStatusFlags(base, (uint32_t)kLPUART_ParityErrorFlag)) ?
                          (kStatus_LPUART_ParityError) : /* GCOVR_EXCL_BR_LINE */
                          (kStatus_LPUART_FlagCannotClearManually));
        }

        if (0U != (statusFlag & (uint32_t)kLPUART_FramingErrorFlag))
        {
            /*
             * $Branch Coverage Justification$
             * $ref fsl_lpuart_c_ref_2$.
             */
            status = ((kStatus_Success == LPUART_ClearStatusFlags(base, (uint32_t)kLPUART_FramingErrorFlag)) ?
                          (kStatus_LPUART_FramingError) : /* GCOVR_EXCL_BR_LINE */
                          (kStatus_LPUART_FlagCannotClearManually));
        }

        if (0U != (statusFlag & (uint32_t)kLPUART_NoiseErrorFlag))
        {
            /*
             * $Branch Coverage Justification$
             * $ref fsl_lpuart_c_ref_2$.
             */
            status = ((kStatus_Success == LPUART_ClearStatusFlags(base, (uint32_t)kLPUART_NoiseErrorFlag)) ?
                          (kStatus_LPUART_NoiseError) : /* GCOVR_EXCL_BR_LINE */
                          (kStatus_LPUART_FlagCannotClearManually));
        }

        if (kStatus_Success != status)
        {
            break;
        }
    }

    return status;
}

/*!
 * brief Reads the receiver data register using a blocking method.
 *
 * This function polls the receiver register, waits for the receiver register full or receiver FIFO
 * has data, and reads data from the TX register.
 *
 * param base LPUART peripheral base address.
 * param data Start address of the buffer to store the received data.
 * param length Size of the buffer.
 * retval kStatus_LPUART_RxHardwareOverrun Receiver overrun happened while receiving data.
 * retval kStatus_LPUART_NoiseError Noise error happened while receiving data.
 * retval kStatus_LPUART_FramingError Framing error happened while receiving data.
 * retval kStatus_LPUART_ParityError Parity error happened while receiving data.
 * retval kStatus_LPUART_Timeout Transmission timed out and was aborted.
 * retval kStatus_Success Successfully received all data.
 */
status_t LPUART_ReadBlocking(LPUART_Type *base, uint8_t *data, size_t length)
{
    assert(NULL != data);

